Get the set of contained LightGroup objects The set of LightGroup objects
  Namespace:   Autodesk.Revit.DB.Lighting
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public IList<LightGroup> GetGroups()
  Visual Basic
Public Function GetGroups As IList(Of LightGroup)
  Visual C++
public:
IList<LightGroup^>^ GetGroups()
 See Also
  LightGroupManager Class
  Autodesk.Revit.DB.Lighting Namespace